atomice1/sQLux-nextp8/esp8266_at_commands.c
/*
 * ESP8266 AT Command Parser and Handlers
 *
 * Implements AT command line parsing, tokenization, and command dispatch
 *
 * Copyright (C) 2026 Chris January
 * GPL-3 with exception for sQLux linking
 */

#include "esp8266_model.h"
#include "esp8266_model_internal.h"
#include "esp8266_at_commands.h"
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <ctype.h>
#include <stdarg.h>
#include <netdb.h>
#include <arpa/inet.h>

/* ========== Forward Declarations from esp8266_model.c ========== */

extern int ESP8266_WiFiConnect(ESP8266_t *esp, const char *ssid, const char *password);
extern void ESP8266_WiFiDisconnect(ESP8266_t *esp);
extern int ESP8266_WiFiScan(ESP8266_t *esp, ScanResult *results, int max_results);
extern int ESP8266_GetConnectedAPInfo(ESP8266_t *esp, char *bssid, uint8_t *channel, int8_t *rssi);
extern int ESP8266_SocketConnect(ESP8266_t *esp, const char *remote_ip, uint16_t remote_port, Connection_Type type);
extern int ESP8266_SocketClose(ESP8266_t *esp, uint8_t link_id);
extern int ESP8266_SocketSend(ESP8266_t *esp, uint8_t link_id, const uint8_t *data, uint16_t len);

/* Virtual AP database access - we need this to query connected AP info */
#define MAX_VIRTUAL_APS 10

/* ========== Command Dispatch Table ========== */

typedef struct {
    const char *command;
    ATCommandHandler handler;
} CommandEntry;

static CommandEntry command_table[] = {
    { "AT", AT_Handler },
    { "RST", AT_RST_Handler },
    { "GMR", AT_GMR_Handler },
    { "E0", ATE0_Handler },
    { "E1", ATE1_Handler },
    { "UART_CUR", AT_UART_CUR_Handler },
    { "UART", AT_UART_CUR_Handler },
    // Phase 2: WiFi commands
    { "CWMODE_CUR", AT_CWMODE_CUR_Handler },
    { "CWMODE_DEF", AT_CWMODE_CUR_Handler },
    { "CWMODE", AT_CWMODE_CUR_Handler },
    { "CWJAP_CUR", AT_CWJAP_CUR_Handler },
    { "CWJAP_DEF", AT_CWJAP_CUR_Handler },
    { "CWJAP", AT_CWJAP_CUR_Handler },
    { "CWQAP", AT_CWQAP_Handler },
    { "CWLAP", AT_CWLAP_Handler },
    { "CIFSR", AT_CIFSR_Handler },
    { "CWSAP_CUR", AT_CWSAP_CUR_Handler },
    { "CWSAP_DEF", AT_CWSAP_CUR_Handler },
    { "CWSAP", AT_CWSAP_CUR_Handler },
    { "CWDHCP_CUR", AT_CWDHCP_CUR_Handler },
    { "CWDHCP_DEF", AT_CWDHCP_CUR_Handler },
    { "CWDHCP", AT_CWDHCP_CUR_Handler },
    { "CIPSTA_CUR", AT_CIPSTA_CUR_Handler },
    { "CIPSTA_DEF", AT_CIPSTA_CUR_Handler },
    { "CIPSTA", AT_CIPSTA_CUR_Handler },
    { "CIPSTAMAC_CUR", AT_CIPSTAMAC_CUR_Handler },
    { "CIPSTAMAC_DEF", AT_CIPSTAMAC_CUR_Handler },
    { "CIPSTAMAC", AT_CIPSTAMAC_CUR_Handler },
    // Phase 3: TCP/IP commands
    { "CIPMUX", AT_CIPMUX_Handler },
    { "CIPSTART", AT_CIPSTART_Handler },
    { "CIPSEND", AT_CIPSEND_Handler },
    { "CIPCLOSE", AT_CIPCLOSE_Handler },
    { "CIPSTATUS", AT_CIPSTATUS_Handler },
    { "CIPSERVER", AT_CIPSERVER_Handler },
    { "CIPDOMAIN", AT_CIPDOMAIN_Handler },
    { "CIPSSLSIZE", AT_CIPSSLSIZE_Handler },
    { NULL, NULL }
};

/* ========== Parser State ========== */

typedef struct {
    char command_name[64];      // e.g., "CWMODE_CUR"
    char command_type;          // '?'=query, '='=set, '\0'=execute, 'T'=test
    char *params[16];           // Parsed parameter strings
    int param_count;
} ParsedCommand;

/* ========== Helper Functions ========== */

static int ESP8266_ParseCommand(const char *line, ParsedCommand *parsed) {
    if (!line || !parsed) return -1;

    memset(parsed, 0, sizeof(*parsed));
    parsed->command_type = '\0';

    // Skip "AT" prefix
    if (line[0] != 'A' || line[1] != 'T') {
        return -1;
    }

    const char *p = &line[2];

    // Handle bare "AT" command
    if (*p == '\0' || *p == '\r' || *p == '\n') {
        strcpy(parsed->command_name, "");
        return 0;
    }

    // Check for extended command (AT+...) vs basic command (ATE0, etc)
    bool is_extended = (*p == '+');
    if (is_extended) {
        p++;
    }

    // Extract command name (letters and numbers)
    char *cmd = parsed->command_name;
    int cmd_len = 0;
    while (*p && (size_t)cmd_len < sizeof(parsed->command_name) - 1) {
        if (isalnum(*p) || *p == '_') {
            *cmd++ = *p++;
            cmd_len++;
        } else {
            break;
        }
    }
    *cmd = '\0';

    if (cmd_len == 0) {
        return -1;  // No command name
    }

    // Check command type and parse parameters
    if (*p == '?') {
        parsed->command_type = '?';  // Query
        p++;
    } else if (*p == '=') {
        p++;
        if (*p == '?') {
            parsed->command_type = 'T';  // Test
            p++;
        } else {
            parsed->command_type = '=';  // Set
            // Parse parameters
            while (*p && parsed->param_count < 16) {
                // Skip whitespace
                while (*p && isspace(*p) && *p != '\r' && *p != '\n') p++;

                if (*p == '\r' || *p == '\n' || *p == '\0') break;

                // Handle quoted strings
                if (*p == '"') {
                    p++;
                    char param_buf[256];
                    int plen = 0;

                    while (*p && *p != '"' && (size_t)plen < sizeof(param_buf) - 1) {
                        if (*p == '\\' && *(p + 1)) {
                            // Handle escape sequences
                            p++;
                            param_buf[plen++] = *p++;
                        } else {
                            param_buf[plen++] = *p++;
                        }
                    }

                    if (*p == '"') p++;

                    param_buf[plen] = '\0';
                    parsed->params[parsed->param_count] = malloc(plen + 1);
                    if (parsed->params[parsed->param_count]) {
                        strcpy(parsed->params[parsed->param_count], param_buf);
                        parsed->param_count++;
                    }
                } else {
                    // Unquoted parameter (number, etc)
                    char param_buf[256];
                    int plen = 0;

