atomice1/sQLux-nextp8/esp8266_at_commands.c
                    while (*p && *p != ',' && !isspace(*p) && (size_t)plen < sizeof(param_buf) - 1) {
                        param_buf[plen++] = *p++;
                    }

                    if (plen > 0) {
                        param_buf[plen] = '\0';
                        parsed->params[parsed->param_count] = malloc(plen + 1);
                        if (parsed->params[parsed->param_count]) {
                            strcpy(parsed->params[parsed->param_count], param_buf);
                            parsed->param_count++;
                        }
                    }
                }

                // Skip to next parameter
                while (*p && *p != ',' && !isspace(*p) && *p != '\r' && *p != '\n') p++;
                if (*p == ',') p++;
            }
        }
    } else {
        parsed->command_type = '\0';  // Execute
    }

    // Skip any trailing whitespace/CRLF
    while (*p && (isspace(*p) || *p == '\r' || *p == '\n')) p++;

    // Command must end cleanly
    if (*p != '\0') {
        return -1;
    }

    return 0;
}

static void ESP8266_FreeParseResult(ParsedCommand *parsed) {
    for (int i = 0; i < parsed->param_count; i++) {
        if (parsed->params[i]) {
            free(parsed->params[i]);
            parsed->params[i] = NULL;
        }
    }
    parsed->param_count = 0;
}

static ATCommandHandler ESP8266_FindHandler(const char *cmd_name) {
    for (int i = 0; command_table[i].command != NULL; i++) {
        if (strcmp(command_table[i].command, cmd_name) == 0) {
            return command_table[i].handler;
        }
    }
    return NULL;
}

/* ========== Core Parser Functions ========== */

void ESP8266_ATProcessByte(ESP8266_t *esp, uint8_t byte) {
    if (!esp) return;

    ESP8266_Internal *state = &esp->state;

    // Check if we're in CIPSEND data collection mode
    if (state->send_mode) {
        // Collect data bytes
        if (state->send_bytes_collected < state->send_bytes_expected) {
            state->send_buffer[state->send_bytes_collected++] = byte;

            // Check if we've collected all bytes
            if (state->send_bytes_collected >= state->send_bytes_expected) {
                // Send the data
                int result = ESP8266_SocketSend(esp, state->send_link_id,
                                               state->send_buffer,
                                               state->send_bytes_expected);

                if (result >= 0) {
                    // Success
                    if (state->mux_enabled) {
                        ESP8266_ATResponse(esp, "SEND OK");
                    } else {
                        ESP8266_ATResponse(esp, "SEND OK");
                    }
                } else {
                    // Error
                    ESP8266_ATResponse(esp, "SEND FAIL");
                }

                // Exit send mode
                state->send_mode = 0;
                state->send_bytes_collected = 0;
                state->send_bytes_expected = 0;
            }
        }
        return;
    }

    // Normal AT command processing
    // Echo if enabled
    if (state->echo_enabled && byte >= 32 && byte < 127) {
        // Queue echo character to TX
        uint16_t next_head = (state->tx_head + 1) % ESP8266_TX_BUFFER_SIZE;
        if (next_head != state->tx_tail) {
            state->tx_buffer[state->tx_head] = byte;
            state->tx_head = next_head;
        }
    }

    // Handle backspace
    if (byte == 0x08 || byte == 0x7F) {
        if (state->cmd_line_pos > 0) {
            state->cmd_line_pos--;
            state->cmd_line_buffer[state->cmd_line_pos] = '\0';
        }
        return;
    }

    // Handle CR+LF line ending
    if (byte == '\r') {
        return;  // Wait for LF
    }

    if (byte == '\n' || byte == '\r') {
        // Process complete line
        if (state->cmd_line_pos > 0) {
            // Trim trailing whitespace
            while (state->cmd_line_pos > 0 && isspace(state->cmd_line_buffer[state->cmd_line_pos - 1])) {
                state->cmd_line_pos--;
            }
            state->cmd_line_buffer[state->cmd_line_pos] = '\0';

            // Dispatch command
            ESP8266_ATDispatch(esp, state->cmd_line_buffer);
        }

        // Reset buffer
        state->cmd_line_pos = 0;
        state->cmd_line_buffer[0] = '\0';
        return;
    }

    // Accumulate character
    if (state->cmd_line_pos < sizeof(state->cmd_line_buffer) - 1) {
        state->cmd_line_buffer[state->cmd_line_pos++] = (char)byte;
        state->cmd_line_buffer[state->cmd_line_pos] = '\0';
    }
}

void ESP8266_ATDispatch(ESP8266_t *esp, const char *cmd_str) {
    if (!esp || !cmd_str) return;

    ParsedCommand parsed;
    char response[ESP8266_RESPONSE_BUFFER_SIZE];
    int result = -1;

    // Parse the command
    printf("[ESP] Received command: %s\n", cmd_str);
    if (ESP8266_ParseCommand(cmd_str, &parsed) < 0) {
        ESP8266_ATError(esp);
        return;
    }

    // Handle bare "AT" command
    if (parsed.command_name[0] == '\0') {
        ESP8266_ATOKK(esp);
        return;
    }

    printf("[ESP] Parsed command: %s, type: %c, params: %d\n",
           parsed.command_name, parsed.command_type, parsed.param_count);

    // Find and invoke handler
    ATCommandHandler handler = ESP8266_FindHandler(parsed.command_name);

    if (!handler) {
        ESP8266_ATError(esp);
        ESP8266_FreeParseResult(&parsed);
        return;
    }

    // Invoke handler
    response[0] = '\0';
    result = handler(esp, parsed.command_name, (const char **)parsed.params, parsed.param_count,
                     response, sizeof(response));

    // Send response
    if (result == 0) {
        // Handler successful
        if (response[0]) {
            // Custom response (e.g., "+CWMODE:1")
            ESP8266_ATResponse(esp, "%s", response);
        }
        ESP8266_ATOKK(esp);
    } else {
        // Handler failed
        ESP8266_ATError(esp);
    }

    ESP8266_FreeParseResult(&parsed);
}

/* ========== Handler Implementations (Phase 1) ========== */

int AT_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
               char *response, size_t max_len) {
    (void)esp;
    (void)command_name;
    (void)params;
    (void)param_count;
    (void)response;
    (void)max_len;
    // AT just returns OK (handled by dispatcher)
    return 0;
}

int AT_RST_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                   char *response, size_t max_len) {
    (void)params;
    (void)command_name;
    (void)param_count;
    (void)response;
    (void)max_len;

    if (!esp) return -1;

    // Reset will happen after OK is sent
    ESP8266_Reset(esp);
    return 0;
}

int AT_GMR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                   char *response, size_t max_len) {
    (void)params;
    (void)command_name;
    (void)param_count;

    if (!esp || !response) return -1;

