atomice1/sQLux-nextp8/esp8266_at_commands.c
    ESP8266_Internal *state = &esp->state;

    snprintf(response, max_len, "%s\r\n%s\r\n%s",
             state->at_version,
             state->sdk_version,
             state->build_date);

    return 0;
}

int ATE0_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                 char *response, size_t max_len) {
    (void)params;
    (void)command_name;
    (void)param_count;
    (void)response;
    (void)max_len;

    if (!esp) return -1;

    ESP8266_SetEcho(esp, 0);
    return 0;
}

int ATE1_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                 char *response, size_t max_len) {
    (void)params;
    (void)command_name;
    (void)param_count;
    (void)response;
    (void)max_len;

    if (!esp) return -1;

    ESP8266_SetEcho(esp, 1);
    return 0;
}

int AT_UART_CUR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                        char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query
        snprintf(response, max_len, "+UART_CUR:%u,%d,%d,%d,%d",
                 state->uart_baud,
                 state->uart_databits,
                 state->uart_stopbits,
                 state->uart_parity,
                 state->uart_flow_control);
        return 0;
    } else if (param_count == 5) {
        // Set
        long baud = ESP8266_ParseInt(params[0]);
        long databits = ESP8266_ParseInt(params[1]);
        long stopbits = ESP8266_ParseInt(params[2]);
        long parity = ESP8266_ParseInt(params[3]);
        long flow = ESP8266_ParseInt(params[4]);

        // Validate ranges
        if (baud < 110 || baud > 115200 * 40) return -1;
        if (databits < 5 || databits > 8) return -1;
        if (stopbits < 1 || stopbits > 3) return -1;
        if (parity < 0 || parity > 2) return -1;
        if (flow < 0 || flow > 3) return -1;

        // Update state
        state->uart_baud = (uint32_t)baud;
        state->uart_databits = (uint8_t)databits;
        state->uart_stopbits = (uint8_t)stopbits;
        state->uart_parity = (uint8_t)parity;
        state->uart_flow_control = (uint8_t)flow;

        response[0] = '\0';
        return 0;
    }

    return -1;
}

/* ========== WiFi Command Handlers (Phase 2) ========== */

int AT_CWMODE_CUR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                          char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query
        snprintf(response, max_len, "+CWMODE_CUR:%d", state->wifi_mode);
        return 0;
    } else if (param_count == 1) {
        // Set
        long mode = ESP8266_ParseInt(params[0]);
        if (mode < 1 || mode > 3) return -1;

        state->wifi_mode = (WiFi_Mode)mode;
        response[0] = '\0';
        return 0;
    }

    return -1;
}

int AT_CWJAP_CUR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                         char *response, size_t max_len) {
    if (!esp || !response) return -1;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query - return current connection info
        if (state->wifi_state != WIFI_STATE_CONNECTED && state->wifi_state != WIFI_STATE_GOT_IP) {
            snprintf(response, max_len, "No AP");
            return 0;
        }

        // Get connected AP info
        char bssid[ESP8266_MAX_MAC_STR_LEN + 1];
        uint8_t channel;
        int8_t rssi;

        if (ESP8266_GetConnectedAPInfo(esp, bssid, &channel, &rssi) < 0) {
            snprintf(response, max_len, "No AP");
            return 0;
        }

        snprintf(response, max_len, "+%s:\"%s\",\"%s\",%d,%d",
                 command_name, state->station_ssid, bssid, channel, rssi);
        return 0;
    } else if (param_count >= 2) {
        // Set - connect to AP
        const char *ssid = params[0];
        const char *password = params[1];

        // Attempt connection
        int result = ESP8266_WiFiConnect(esp, ssid, password);

        if (result == 0) {
            // Connection initiated successfully
            response[0] = '\0';
            return 0;
        } else {
            // Connection failed - return error code
            snprintf(response, max_len, "+CWJAP:3");  // Error code 3: cannot find target AP
            return -1;
        }
    }

    return -1;
}

int AT_CWQAP_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                     char *response, size_t max_len) {
    (void)params;
    (void)command_name;
    (void)param_count;
    (void)response;
    (void)max_len;

    if (!esp) return -1;

    // Disconnect from AP
    ESP8266_WiFiDisconnect(esp);

    return 0;
}

int AT_CWLAP_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                     char *response, size_t max_len) {
    if (!esp || !response) return -1;

    (void)params;
    (void)command_name;
    (void)param_count;

    // Get scan results
    ScanResult results[ESP8266_MAX_AP_RESULTS];
    int count = ESP8266_WiFiScan(esp, results, ESP8266_MAX_AP_RESULTS);

    // Format response with all APs
    size_t pos = 0;
    for (int i = 0; i < count && pos < max_len - 100; i++) {
        int written = snprintf(response + pos, max_len - pos,
                               "+CWLAP:%d,\"%s\",%d,\"%s\",%d,%d,%d\r\n",
                               results[i].encryption,
                               results[i].ssid,
                               results[i].rssi,
                               results[i].bssid,
                               results[i].channel,
                               results[i].freq_offset,
                               results[i].freq_cal);
        if (written > 0) {
            pos += written;
        }
    }

