atomice1/sQLux-nextp8/esp8266_at_commands.c
    // Remove trailing CRLF (dispatcher will add it)
    if (pos >= 2 && response[pos-2] == '\r' && response[pos-1] == '\n') {
        response[pos-2] = '\0';
    }

    return 0;
}

int AT_CIFSR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                     char *response, size_t max_len) {
    (void)params;
    (void)command_name;
    (void)param_count;

    if (!esp || !response) return -1;

    ESP8266_Internal *state = &esp->state;

    // Return station IP and MAC
    snprintf(response, max_len, "+CIFSR:STAIP,\"%s\"\r\n+CIFSR:STAMAC,\"%s\"",
             state->station_ip, state->station_mac);

    return 0;
}

int AT_CWSAP_CUR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                         char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query
        snprintf(response, max_len, "+CWSAP_CUR:\"%s\",\"%s\",%d,%d,4,0",
                 state->ap_ssid[0] ? state->ap_ssid : "ESP8266",
                 state->ap_password,
                 state->ap_channel,
                 state->ap_encryption);
        return 0;
    } else if (param_count >= 4) {
        // Set - configure SoftAP
        const char *ssid = params[0];
        const char *password = params[1];
        long channel = ESP8266_ParseInt(params[2]);
        long encryption = ESP8266_ParseInt(params[3]);

        // Validate
        if (channel < 1 || channel > 13) return -1;
        if (encryption < 0 || encryption > 4 || encryption == 1) return -1;  // WEP not supported

        // Apply config
        strncpy(state->ap_ssid, ssid, ESP8266_MAX_SSID_LEN);
        state->ap_ssid[ESP8266_MAX_SSID_LEN] = '\0';
        strncpy(state->ap_password, password, ESP8266_MAX_PASSWORD_LEN);
        state->ap_password[ESP8266_MAX_PASSWORD_LEN] = '\0';
        state->ap_channel = (uint8_t)channel;
        state->ap_encryption = (Encryption_Type)encryption;

        response[0] = '\0';
        return 0;
    }

    return -1;
}

int AT_CWDHCP_CUR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                          char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query - return DHCP state as bitfield
        int dhcp_state = (state->dhcp_enabled[0] ? 1 : 0) |
                         (state->dhcp_enabled[1] ? 2 : 0);
        snprintf(response, max_len, "+CWDHCP_CUR:%d", dhcp_state);
        return 0;
    } else if (param_count == 2) {
        // Set
        long mode = ESP8266_ParseInt(params[0]);
        long enable = ESP8266_ParseInt(params[1]);

        if (mode < 0 || mode > 2) return -1;
        if (enable < 0 || enable > 1) return -1;

        // Apply settings
        if (mode == 0 || mode == 2) {
            state->dhcp_enabled[0] = (uint8_t)enable;  // SoftAP
        }
        if (mode == 1 || mode == 2) {
            state->dhcp_enabled[1] = (uint8_t)enable;  // Station
        }

        response[0] = '\0';
        return 0;
    }

    return -1;
}

int AT_CIPSTA_CUR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                          char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query
        snprintf(response, max_len, "+CIPSTA_CUR:ip:\"%s\"\r\n+CIPSTA_CUR:gateway:\"%s\"\r\n+CIPSTA_CUR:netmask:\"%s\"",
                 state->station_ip, state->station_gateway, state->station_netmask);
        return 0;
    } else if (param_count >= 1) {
        // Set
        const char *ip = params[0];

        // Validate IP
        if (ESP8266_ParseIP(ip) < 0) return -1;

        // Apply IP
        strncpy(state->station_ip, ip, ESP8266_MAX_IP_STR_LEN);
        state->station_ip[ESP8266_MAX_IP_STR_LEN] = '\0';

        // Optional gateway and netmask
        if (param_count >= 2) {
            const char *gateway = params[1];
            if (ESP8266_ParseIP(gateway) < 0) return -1;
            strncpy(state->station_gateway, gateway, ESP8266_MAX_IP_STR_LEN);
            state->station_gateway[ESP8266_MAX_IP_STR_LEN] = '\0';
        }

        if (param_count >= 3) {
            const char *netmask = params[2];
            if (ESP8266_ParseIP(netmask) < 0) return -1;
            strncpy(state->station_netmask, netmask, ESP8266_MAX_IP_STR_LEN);
            state->station_netmask[ESP8266_MAX_IP_STR_LEN] = '\0';
        }

        // Disable DHCP if static IP is set
        state->dhcp_enabled[1] = 0;

        response[0] = '\0';
        return 0;
    }

    return -1;
}

int AT_CIPSTAMAC_CUR_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                              char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query
        snprintf(response, max_len, "+CIPSTAMAC_CUR:\"%s\"", state->station_mac);
        return 0;
    } else if (param_count == 1) {
        // Set
        const char *mac = params[0];

        // Validate MAC
        if (ESP8266_ParseMAC(mac) < 0) return -1;

        // Apply MAC
        strncpy(state->station_mac, mac, ESP8266_MAX_MAC_STR_LEN);
        state->station_mac[ESP8266_MAX_MAC_STR_LEN] = '\0';

        response[0] = '\0';
        return 0;
    }

    return -1;
}

/* ========== Phase 3: TCP/IP Commands ========== */

/**
 * AT+CIPMUX - Enable/disable multiple connections (0=single, 1=multiple)
 */
int AT_CIPMUX_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                      char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

