atomice1/sQLux-nextp8/esp8266_at_commands.c
    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query current mux mode
        snprintf(response, max_len, "+CIPMUX:%d", state->mux_enabled);
        return 0;
    } else if (param_count == 1) {
        // Set mux mode
        long mode = ESP8266_ParseInt(params[0]);
        printf("[ESP] Setting CIPMUX to %ld\n", mode);
        if (mode < 0 || mode > 1) return -1;

        // Cannot change mode if any connections are active
        for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
            if (state->connections[i].active) {
                return -1;  // ERROR: connections active
            }
        }

        state->mux_enabled = (uint8_t)mode;
        response[0] = '\0';
        return 0;
    }

    return -1;
}

/**
 * AT+CIPSTART - Start TCP/UDP connection
 * Format: AT+CIPSTART=<type>,<remote_ip>,<remote_port>[,<local_port>]
 * Or with mux: AT+CIPSTART=<link_id>,<type>,<remote_ip>,<remote_port>[,<local_port>]
 */
int AT_CIPSTART_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                        char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;
    int link_id = 0;
    int param_offset = 0;

    // If mux enabled, first parameter is link_id
    if (state->mux_enabled) {
        if (param_count < 4) return -1;
        link_id = ESP8266_ParseInt(params[0]);
        if (link_id < 0 || link_id >= ESP8266_MAX_CONNECTIONS) return -1;
        param_offset = 1;
    } else {
        if (param_count < 3) return -1;
        link_id = 0;  // Single connection mode always uses link 0
    }

    // Parse connection type
    const char *type_str = params[param_offset];
    Connection_Type type;
    if (ESP8266_StrCmp(type_str, "\"TCP\"") == 0 || ESP8266_StrCmp(type_str, "TCP") == 0) {
        type = CONNECTION_TYPE_TCP;
    } else if (ESP8266_StrCmp(type_str, "\"UDP\"") == 0 || ESP8266_StrCmp(type_str, "UDP") == 0) {
        type = CONNECTION_TYPE_UDP;
    } else if (ESP8266_StrCmp(type_str, "\"SSL\"") == 0 || ESP8266_StrCmp(type_str, "SSL") == 0) {
        type = CONNECTION_TYPE_SSL;
    } else {
        return -1;
    }

    // Parse remote IP/domain (strip quotes if present)
    const char *remote_ip = params[param_offset + 1];
    char ip_buf[ESP8266_MAX_DOMAIN_LEN];
    if (remote_ip[0] == '"') {
        int len = strlen(remote_ip);
        if (len < 2 || remote_ip[len-1] != '"') return -1;
        strncpy(ip_buf, remote_ip + 1, sizeof(ip_buf) - 1);
        ip_buf[len - 2] = '\0';
        remote_ip = ip_buf;
    }

    // Parse remote port
    long remote_port = ESP8266_ParseInt(params[param_offset + 2]);
    if (remote_port < 0 || remote_port > 65535) return -1;

    // Connect
    int result = ESP8266_SocketConnect(esp, remote_ip, (uint16_t)remote_port, type);
    if (result < 0) {
        snprintf(response, max_len, "ERROR");
        return -1;
    }

    // Success - for UDP, connection is immediate
    // For TCP/SSL, connection is asynchronous and CONNECT message will be sent by poll loop
    if (type == CONNECTION_TYPE_UDP) {
        if (state->mux_enabled) {
            snprintf(response, max_len, "%d,CONNECT", link_id);
        } else {
            snprintf(response, max_len, "CONNECT");
        }
    } else {
        // TCP/SSL: empty response, framework will add OK, CONNECT message will come later
        response[0] = '\0';
    }

    return 0;
}

/**
 * AT+CIPDOMAIN - DNS lookup
 * Format: AT+CIPDOMAIN="<domain>"
 * Returns: +CIPDOMAIN:<ip_address>
 */
int AT_CIPDOMAIN_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                         char *response, size_t max_len) {
    if (!esp || !response || param_count < 1) return -1;
    (void)command_name;

    // Parse domain name (strip quotes if present)
    const char *domain = params[0];
    char domain_buf[ESP8266_MAX_DOMAIN_LEN];
    if (domain[0] == '"') {
        int len = strlen(domain);
        if (len < 2 || domain[len-1] != '"') return -1;
        strncpy(domain_buf, domain + 1, sizeof(domain_buf) - 1);
        domain_buf[len - 2] = '\0';
        domain = domain_buf;
    }

    // Perform DNS lookup using gethostbyname
    struct hostent *host = gethostbyname(domain);
    if (!host || !host->h_addr_list[0]) {
        return -1;
    }

    // Convert IP address to string
    struct in_addr addr;
    memcpy(&addr, host->h_addr_list[0], sizeof(struct in_addr));
    const char *ip_str = inet_ntoa(addr);
    if (!ip_str) {
        return -1;
    }

    // Format response: +CIPDOMAIN:<ip>
    snprintf(response, max_len, "+CIPDOMAIN:%s", ip_str);
    return 0;
}

/**
 * AT+CIPSEND - Send data on a connection
 * Format: AT+CIPSEND=<length> (single connection)
 * Or: AT+CIPSEND=<link_id>,<length> (multiple connections)
 * This initiates send mode - we return ">" prompt and wait for data
 */
int AT_CIPSEND_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                       char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;
    int link_id = 0;
    int length = 0;

    if (state->mux_enabled) {
        if (param_count < 2) return -1;
        link_id = ESP8266_ParseInt(params[0]);
        if (link_id < 0 || link_id >= ESP8266_MAX_CONNECTIONS) return -1;
        length = ESP8266_ParseInt(params[1]);
    } else {
        if (param_count < 1) return -1;
        link_id = 0;
        length = ESP8266_ParseInt(params[0]);
    }

    if (length <= 0 || length > 2048) return -1;

    // Check if connection is active
    if (!state->connections[link_id].active) {
        snprintf(response, max_len, "link is not valid");
        return -1;
    }

    // Enter data collection mode
    state->send_mode = 1;
    state->send_link_id = link_id;
    state->send_bytes_expected = length;
    state->send_bytes_collected = 0;

