atomice1/sQLux-nextp8/esp8266_at_commands.c
    // Send ">" prompt to indicate ready for data
    snprintf(response, max_len, ">");

    return 0;
}

/**
 * AT+CIPCLOSE - Close a connection
 * Format: AT+CIPCLOSE (single connection)
 * Or: AT+CIPCLOSE=<link_id> (multiple connections)
 */
int AT_CIPCLOSE_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                        char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;
    int link_id = 0;

    if (param_count == 0) {
        // Execute form - close connection 0
        link_id = 0;
    } else if (param_count == 1) {
        // Close specific connection
        if (state->mux_enabled) {
            link_id = ESP8266_ParseInt(params[0]);
            if (link_id < 0 || link_id >= ESP8266_MAX_CONNECTIONS) return -1;
        } else {
            link_id = 0;
        }
    } else {
        return -1;
    }

    if (ESP8266_SocketClose(esp, link_id) < 0) {
        return -1;
    }

    if (state->mux_enabled) {
        snprintf(response, max_len, "%d,CLOSED", link_id);
    } else {
        snprintf(response, max_len, "CLOSED");
    }

    return 0;
}

/**
 * AT+CIPSTATUS - Get connection status
 */
int AT_CIPSTATUS_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                         char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)params;
    (void)command_name;
    (void)param_count;

    ESP8266_Internal *state = &esp->state;

    // Build status response
    char *p = response;
    size_t remaining = max_len;
    int written;

    // Status line
    const char *status_str;
    if (state->wifi_state == WIFI_STATE_GOT_IP) {
        status_str = "STATUS:3";  // 3 = connected
    } else {
        status_str = "STATUS:5";  // 5 = WiFi disconnected
    }

    written = snprintf(p, remaining, "%s\n", status_str);
    p += written;
    remaining -= written;

    // List active connections
    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        Connection *conn = &state->connections[i];
        if (conn->active && remaining > 0) {
            const char *type_str;
            if (conn->type == CONNECTION_TYPE_TCP) type_str = "TCP";
            else if (conn->type == CONNECTION_TYPE_UDP) type_str = "UDP";
            else type_str = "SSL";

            written = snprintf(p, remaining, "+CIPSTATUS:%d,\"%s\",\"%s\",%u,%u,%d\n",
                             i, type_str, conn->remote_ip, conn->remote_port,
                             conn->local_port, 0);  // 0 = client mode
            if (written > 0 && (size_t)written < remaining) {
                p += written;
                remaining -= written;
            }
        }
    }

    return 0;
}

/**
 * AT+CIPSERVER - Start/stop TCP server
 * Format: AT+CIPSERVER=<mode>[,<port>]
 * mode: 1=create server, 0=delete server
 */
int AT_CIPSERVER_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                         char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;
    (void)max_len;

    ESP8266_Internal *state = &esp->state;

    if (param_count < 1) return -1;

    long mode = ESP8266_ParseInt(params[0]);
    if (mode < 0 || mode > 1) return -1;

    if (mode == 1) {
        // Create server
        uint16_t port = 333;  // Default port
        if (param_count >= 2) {
            long p = ESP8266_ParseInt(params[1]);
            if (p < 0 || p > 65535) return -1;
            port = (uint16_t)p;
        }

        // Server mode requires mux enabled
        if (!state->mux_enabled) {
            return -1;
        }

        // TODO: Create listening socket
        // For now, just mark server as active
        state->server_active = 1;
        state->server_port = port;
        state->server_socket = -1;  // Placeholder

        response[0] = '\0';
        return 0;
    } else {
        // Delete server
        if (state->server_socket >= 0) {
            // TODO: Close listening socket
        }
        state->server_active = 0;
        state->server_socket = -1;

        response[0] = '\0';
        return 0;
    }
}

/**
 * AT+CIPSSLSIZE - Set SSL buffer size
 * Format: AT+CIPSSLSIZE=<size>
 * size: 2048 ~ 4096
 */
int AT_CIPSSLSIZE_Handler(ESP8266_t *esp, const char *command_name, const char **params, int param_count,
                          char *response, size_t max_len) {
    if (!esp || !response) return -1;
    (void)command_name;

    ESP8266_Internal *state = &esp->state;

    if (param_count == 0) {
        // Query current SSL buffer size
        snprintf(response, max_len, "+CIPSSLSIZE:%d", state->ssl_buffer_size);
        return 0;
    } else if (param_count == 1) {
        // Set SSL buffer size
        long size = ESP8266_ParseInt(params[0]);
        if (size < 2048 || size > 4096) return -1;

        state->ssl_buffer_size = (uint16_t)size;
        response[0] = '\0';
        return 0;
    }

    return -1;
}

/* ========== Helper Functions ========== */

long ESP8266_ParseInt(const char *str) {
    if (!str) return -1;
    char *endptr;
    long value = strtol(str, &endptr, 10);
    if (*endptr != '\0') return -1;
    return value;
}

int ESP8266_ParseMAC(const char *str) {
    if (!str) return -1;
    // Format: xx:xx:xx:xx:xx:xx
    int a, b, c, d, e, f;
    if (sscanf(str, "%x:%x:%x:%x:%x:%x", &a, &b, &c, &d, &e, &f) != 6) {
        return -1;
    }
    if (a < 0 || a > 255 || b < 0 || b > 255 || c < 0 || c > 255 ||
        d < 0 || d > 255 || e < 0 || e > 255 || f < 0 || f > 255) {
        return -1;
    }
    return 0;
}

int ESP8266_ParseIP(const char *str) {
    if (!str) return -1;
    // Format: 192.168.1.1
    int a, b, c, d;
    if (sscanf(str, "%d.%d.%d.%d", &a, &b, &c, &d) != 4) {
        return -1;
    }
    if (a < 0 || a > 255 || b < 0 || b > 255 || c < 0 || c > 255 || d < 0 || d > 255) {
        return -1;
    }
    return 0;
}

int ESP8266_StrCmp(const char *s1, const char *s2) {
    // Simple string compare for now; can enhance with unquoting later
    if (!s1 || !s2) return 1;
    return strcmp(s1, s2);
}

void ESP8266_ATCommandsInit(void) {
    // Initialize command table if needed (could register handlers dynamically)
}
